src/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтказыПоЗаявкам</xr:Item>
				<xr:Item>InformationRegister.ИсторияЗаявокПокупателя</xr:Item>
				<xr:Item>InformationRegister.ДокументыКорректировок</xr:Item>
				<xr:Item>InformationRegister.ВозможныеЗаменыНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукционПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданВ77</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоступленияПоставщика</Name>
					<Comment>Номер поступления поставщика (только для загрузки ответа ftp)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураЗамена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияЗамена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГарантированныйЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокОжидаемыйЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеСтрокиЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныОтказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженИзОП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаказПоставщику/Forms/ФормаЗагрузкиНескЗаказовУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Таблица;
	
	Параметры.Свойство("Контрагент", Контрагент);
	//Параметры.Свойство("ЗаказПоставщику", ЗаказПоставщику);
	Параметры.Свойство("Таблица", Таблица);
	Параметры.Свойство("ДопустимыйПроцентОтклонения", ДопустимыйПроцентОтклонения);
	Параметры.Свойство("ЦенаВключаетНДС", ЦенаВключаетНДС);
	Параметры.Свойство("ЕстьКомментарий", ЕстьКомментарий);	
	
	ТолькоРазличия = Истина;
	
	Если ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда 
		АдресХранилища = ПоместитьВоВременноеХранилище(Таблица);
		
		ЗаполнитьИзТаблицыНаСервере();
		//Товары.Загрузить(Таблица);
		//ПолныеТовары = Таблица.Скопировать();
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	СостоянияСтрокДокументов.Ссылка
	                |ИЗ
	                |	Справочник.СостоянияСтрокДокументов КАК СостоянияСтрокДокументов
	                |ГДЕ
	                |	СостоянияСтрокДокументов.ИспользуетсяВЗаказах";
	Элементы.ТоварыПричинаОтказа.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	//Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьРазличие", Истина);
	
	Элементы.ТоварыКомментарий.Видимость = ЕстьКомментарий;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Отказ = Ложь;
	Для Каждого СтрокаТЧ Из Товары Цикл 
		Если СтрокаТЧ.Различие < 0 И Не ЗначениеЗаполнено(СтрокаТЧ.ПричинаОтказа) Тогда 
			Отказ = Истина;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнена причина отказа в строке №" + СтрокаТЧ.НомерСтроки;
			СообщениеПользователю.Сообщить();
		КонецЕсли;
	КонецЦикла;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ПоместитьТЧВоВременноеХранилище());
КонецПроцедуры

&НаСервере 
Функция ПоместитьТЧВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(Товары.Выгрузить());
КонецФункции

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыПричинаОтказа" Или Поле.Имя = "ТоварыКоличество" Тогда 
		Возврат;	
	ИначеЕсли Поле.Имя = "ТоварыНомерСтроки" Тогда 
		СтрокаТЧ = Товары.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ТипЗнч(СтрокаТЧ.НомерСтроки) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
			СтандартнаяОбработка = Ложь;
			ОткрытьЗначение(СтрокаТЧ.НомерСтроки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	СоответствиеПолейИДанных = Новый Соответствие;
	СоответствиеПолейИДанных.Вставить("ТоварыНоменклатура", "Номенклатура");
	СоответствиеПолейИДанных.Вставить("ТоварыСтрокаЗаявкиЗаявкаНомер", "СтрокаЗаявки.Заявка");
	СоответствиеПолейИДанных.Вставить("ТоварыНоменклатураИзготовитель", "Номенклатура.Изготовитель");
	
	ПутьКДанным = СоответствиеПолейИДанных[Поле.Имя];
	Если ПутьКДанным <> Неопределено Тогда 
		СтрокаТовары = Товары.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Данные = Вычислить("СтрокаТовары." + ПутьКДанным);
		Если ПутьКДанным = "СтрокаЗаявки.Заявка" Тогда 
			ОткрытьЗначение(ПолучитьПоследнийДокументКорректировки(Данные));
		Иначе	
			ОткрытьЗначение(Данные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьПоследнийДокументКорректировки(Заявка)
	Возврат Документы.ЗаявкаПокупателя.ПолучитьПоследнийДокументКорректировки(Заявка);
КонецФункции

&НаКлиенте
Процедура ТолькоРазличияПриИзменении(Элемент)
	ЗаполнитьИзТаблицыНаСервере();		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзТаблицыНаСервере()
	ЕдинаяТаблица = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Товары.ПолучитьЭлементы().Очистить();
	Дерево = РеквизитФормыВЗначение("Товары");
	
	Для Каждого СтрокаТЧ Из ЕдинаяТаблица Цикл 
		КоличествоПлан = ?(СтрокаТЧ.КоличествоПлан = Неопределено, 0, СтрокаТЧ.КоличествоПлан);
		ЦенаПлан = ?(СтрокаТЧ.ЦенаПлан = Неопределено, 0, СтрокаТЧ.ЦенаПлан);
		
		Если Не (СтрокаТЧ.Количество - КоличествоПлан <> 0 Или ?(ЦенаПлан = 0, 999999, 100*(СтрокаТЧ.Цена - ЦенаПлан)/ЦенаПлан)) И ТолькоРазличия Тогда 
			Продолжить;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Ссылка) Тогда 
			СтрокаРодитель = Дерево.Строки.Найти(СтрокаТЧ.Ссылка, "НомерСтроки");
		Иначе
			СтрокаРодитель = Дерево.Строки.Найти("<Не найден заказ>", "НомерСтроки"); 
		КонецЕсли;
		
		Если СтрокаРодитель = Неопределено Тогда 
			СтрокаРодитель = Дерево.Строки.Добавить();
			Если ЗначениеЗаполнено(СтрокаТЧ.Ссылка) Тогда 
				СтрокаРодитель.НомерСтроки = СтрокаТЧ.Ссылка;
			Иначе
				СтрокаРодитель.НомерСтроки = "<Не найден заказ>";
			КонецЕсли;
		КонецЕсли;
		
		Строка = СтрокаРодитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаТЧ);
		
		Строка.Различие = Строка.Количество - Строка.КоличествоПлан;
		Если Строка.Различие < 0 Тогда 
			Строка.ПричинаОтказа = Справочники.СостоянияСтрокДокументов.НетНаСкладе;
		КонецЕсли;	
		Строка.ЦенаРазличие = ?(Строка.ЦенаПлан = 0, 999999, 100*(Строка.Цена - Строка.ЦенаПлан)/Строка.ЦенаПлан);
		Строка.ЦенаНачальная = Строка.Цена;
		Если Строка.ЦенаРазличие <> 0 Или Строка.Различие <> 0 Тогда 
			Строка.ЕстьРазличие = Истина;
		КонецЕсли;
	КонецЦикла;
	АдресХранилища = ПоместитьВоВременноеХранилище(ЕдинаяТаблица);
	
	ЗначениеВРеквизитФормы(Дерево, "Товары");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(Строка.НомерСтроки) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
		Строка.Количество = 0;
		Возврат;
	КонецЕсли;
	
	Строка.Различие = Строка.Количество - Строка.КоличествоПлан;
	Если Строка.Различие < 0 Тогда 
		Строка.ПричинаОтказа = Справочники.СостоянияСтрокДокументов.НетНаСкладе;
	КонецЕсли;
	
	Если Строка.ЦенаРазличие <> 0 Или Строка.Различие <> 0 Тогда 
		Строка.ЕстьРазличие = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ТоварыПриОкончанииРедактированияНаСервере(ИдентфикаторСтроки)
	
	ЕдинаяТаблица = ПолучитьИзВременногоХранилища(АдресХранилища);

	СтрокаДерева = Товары.НайтиПоИдентификатору(ИдентфикаторСтроки);
	Если ТипЗнч(СтрокаДерева.НомерСтроки) = Тип("Число") Тогда 
		Заказ = СтрокаДерева.ПолучитьРодителя().НомерСтроки;
		Строки = ЕдинаяТаблица.НайтиСтроки(Новый Структура("Ссылка,НомерСтроки", Заказ, СтрокаДерева.НомерСтроки));
		ЗаполнитьЗначенияСвойств(Строки.Получить(0), СтрокаДерева);
	КонецЕсли;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ЕдинаяТаблица);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТоварыПриОкончанииРедактированияНаСервере(Элемент.ТекущаяСтрока);
КонецПроцедуры
